/**
  ******************************************************************************
  * @file    gpio.h
  * @author  HUGE-IC Application Team
  * @version V1.0.0
  * @date    01-05-2021
  * @brief   This file contains all the GPIO LL firmware functions.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2021 HUGE-IC</center></h2>
  *
  *
  */ 
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GPIO_H__
#define __GPIO_H__

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|   P0   |----------------------------------------------------------|
|        | 7:0 |      P0 数据寄存器                                 |
|-------------------------------------------------------------------|
********************************************************************/
// P0
#define _P0
#define GPIO_P07_DATA(n)                 ((n) << 7)   // P07 数据
#define GPIO_P06_DATA(n)                 ((n) << 6)   // P06 数据
#define GPIO_P05_DATA(n)                 ((n) << 5)   // P05 数据
#define GPIO_P04_DATA(n)                 ((n) << 4)   // P04 数据
#define GPIO_P03_DATA(n)                 ((n) << 3)   // P03 数据
#define GPIO_P02_DATA(n)                 ((n) << 2)   // P02 数据
#define GPIO_P01_DATA(n)                 ((n) << 1)   // P01 数据
#define GPIO_P00_DATA(n)                 ((n) << 0)   // P00 数据

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|   P1   |----------------------------------------------------------|
|        | 7:0 |      P1 数据寄存器                                 |
|-------------------------------------------------------------------|
********************************************************************/
// P1
#define _P1
#define GPIO_P17_DATA(n)                 ((n) << 7)   // P17 数据
#define GPIO_P16_DATA(n)                 ((n) << 6)   // P16 数据
#define GPIO_P15_DATA(n)                 ((n) << 5)   // P15 数据
#define GPIO_P14_DATA(n)                 ((n) << 4)   // P14 数据
#define GPIO_P13_DATA(n)                 ((n) << 3)   // P13 数据
#define GPIO_P12_DATA(n)                 ((n) << 2)   // P12 数据
#define GPIO_P11_DATA(n)                 ((n) << 1)   // P11 数据
#define GPIO_P10_DATA(n)                 ((n) << 0)   // P10 数据

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|   P2   |----------------------------------------------------------|
|        | 7:0 |      P2 数据寄存器                                 |
|-------------------------------------------------------------------|
********************************************************************/
// P2
#define _P2
#define GPIO_P27_DATA(n)                 ((n) << 7)   // P27 数据
#define GPIO_P26_DATA(n)                 ((n) << 6)   // P26 数据
#define GPIO_P25_DATA(n)                 ((n) << 5)   // P25 数据
#define GPIO_P24_DATA(n)                 ((n) << 4)   // P24 数据
#define GPIO_P23_DATA(n)                 ((n) << 3)   // P23 数据
#define GPIO_P22_DATA(n)                 ((n) << 2)   // P22 数据
#define GPIO_P21_DATA(n)                 ((n) << 1)   // P21 数据
#define GPIO_P20_DATA(n)                 ((n) << 0)   // P20 数据

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|   P3   |----------------------------------------------------------|
|        | 7:0 |      P3 数据寄存器                                 |
|-------------------------------------------------------------------|
********************************************************************/
// P3
#define _P3
#define GPIO_P31_DATA(n)                 ((n) << 1)   // P31 数据
#define GPIO_P30_DATA(n)                 ((n) << 0)   // P30 数据

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
|        |  7  | P07 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  6  | P06 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  5  | P05 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
| P0_PU  |  4  | P04 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  3  | P03 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  2  | P02 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  1  | P01 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P00 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P0_PU
#define _P0_PU
#define GPIO_P07_PULL_UP(n)              ((n) << 7)   // P07 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P06_PULL_UP(n)              ((n) << 6)   // P06 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P05_PULL_UP(n)              ((n) << 5)   // P05 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P04_PULL_UP(n)              ((n) << 4)   // P04 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P03_PULL_UP(n)              ((n) << 3)   // P03 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P02_PULL_UP(n)              ((n) << 2)   // P02 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P01_PULL_UP(n)              ((n) << 1)   // P01 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P00_PULL_UP(n)              ((n) << 0)   // P00 上拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
|        |  7  | P17 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  6  | P16 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  5  | P15 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
| P1_PU  |  4  | P14 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  3  | P13 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  2  | P12 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  1  | P11 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P10 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P1_PU
#define _P1_PU
#define GPIO_P17_PULL_UP(n)              ((n) << 7)   // P17 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P16_PULL_UP(n)              ((n) << 6)   // P16 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P15_PULL_UP(n)              ((n) << 5)   // P15 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P14_PULL_UP(n)              ((n) << 4)   // P14 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P13_PULL_UP(n)              ((n) << 3)   // P13 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P12_PULL_UP(n)              ((n) << 2)   // P12 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P11_PULL_UP(n)              ((n) << 1)   // P11 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P10_PULL_UP(n)              ((n) << 0)   // P10 上拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
|        |  7  | P27 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  6  | P26 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  5  | P25 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
| P2_PU  |  4  | P24 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  3  | P23 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  2  | P22 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  1  | P21 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P20 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P2_PU
#define _P2_PU
#define GPIO_P27_PULL_UP(n)              ((n) << 7)   // P27 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P26_PULL_UP(n)              ((n) << 6)   // P26 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P25_PULL_UP(n)              ((n) << 5)   // P25 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P24_PULL_UP(n)              ((n) << 4)   // P24 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P23_PULL_UP(n)              ((n) << 3)   // P23 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P22_PULL_UP(n)              ((n) << 2)   // P22 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P21_PULL_UP(n)              ((n) << 1)   // P21 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P20_PULL_UP(n)              ((n) << 0)   // P20 上拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
| P3_PU  |  1  | P31 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P30 上拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P3_PU
#define _P3_PU
#define GPIO_P31_PULL_UP(n)              ((n) << 1)   // P31 上拉使能  0x0:关闭  0x1:打开
#define GPIO_P30_PULL_UP(n)              ((n) << 0)   // P30 上拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
|        |  7  | P07 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  6  | P06 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  5  | P05 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
| P0_PD  |  4  | P04 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  3  | P03 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  2  | P02 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  1  | P01 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P00 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P0_PD
#define _P0_PD
#define GPIO_P07_PULL_PD(n)              ((n) << 7)   // P07 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P06_PULL_PD(n)              ((n) << 6)   // P06 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P05_PULL_PD(n)              ((n) << 5)   // P05 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P04_PULL_PD(n)              ((n) << 4)   // P04 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P03_PULL_PD(n)              ((n) << 3)   // P03 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P02_PULL_PD(n)              ((n) << 2)   // P02 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P01_PULL_PD(n)              ((n) << 1)   // P01 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P00_PULL_PD(n)              ((n) << 0)   // P00 下拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
|        |  7  | P17 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  6  | P16 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  5  | P15 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
| P1_PD  |  4  | P14 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  3  | P13 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  2  | P12 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  1  | P11 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P10 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P1_PD
#define _P1_PD
#define GPIO_P17_PULL_PD(n)              ((n) << 7)   // P17 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P16_PULL_PD(n)              ((n) << 6)   // P16 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P15_PULL_PD(n)              ((n) << 5)   // P15 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P14_PULL_PD(n)              ((n) << 4)   // P14 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P13_PULL_PD(n)              ((n) << 3)   // P13 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P12_PULL_PD(n)              ((n) << 2)   // P12 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P11_PULL_PD(n)              ((n) << 1)   // P11 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P10_PULL_PD(n)              ((n) << 0)   // P10 下拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
|        |  7  | P27 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  6  | P26 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  5  | P25 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
| P2_PD  |  4  | P24 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  3  | P23 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  2  | P22 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  1  | P21 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P20 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P2_PD
#define _P2_PD
#define GPIO_P27_PULL_PD(n)              ((n) << 7)   // P27 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P26_PULL_PD(n)              ((n) << 6)   // P26 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P25_PULL_PD(n)              ((n) << 5)   // P25 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P24_PULL_PD(n)              ((n) << 4)   // P24 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P23_PULL_PD(n)              ((n) << 3)   // P23 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P22_PULL_PD(n)              ((n) << 2)   // P22 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P21_PULL_PD(n)              ((n) << 1)   // P21 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P20_PULL_PD(n)              ((n) << 0)   // P20 下拉使能  0x0:关闭  0x1:打开

/********************************************************************
|-------------------------------------------------------------------|
|        | Bit |                    Description                     |
|        |----------------------------------------------------------|
| P3_PD  |  1  | P31 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|        |  0  | P30 下拉电阻(30K)使能控制位  0x0:关闭  0x1:打开    |
|------------------------------------------------------------------—|
********************************************************************/
// P3_PD
#define _P3_PD
#define GPIO_P31_PULL_PD(n)              ((n) << 1)   // P31 下拉使能  0x0:关闭  0x1:打开
#define GPIO_P30_PULL_PD(n)              ((n) << 0)   // P30 下拉使能  0x0:关闭  0x1:打开

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           | 
|        |--------------------------------------------------------------------------------|
| P0_MD0 | 7:6 | P03 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 5:4 | P02 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 3:2 | P01 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P00 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P0_MD0
#define _P0_MD0
#define GPIO_P03_MODE_SEL(n)            ((n) << 6)   // P03 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P02_MODE_SEL(n)            ((n) << 4)   // P02 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P01_MODE_SEL(n)            ((n) << 2)   // P01 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P00_MODE_SEL(n)            ((n) << 0)   // P00 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           |
|        |--------------------------------------------------------------------------------|
| P0_MD1 | 7:6 | P07 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 5:4 | P06 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 3:2 | P05 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P04 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P0_MD1
#define _P0_MD1
#define GPIO_P07_MODE_SEL(n)            ((n) << 6)   // P07 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P06_MODE_SEL(n)            ((n) << 4)   // P06 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P05_MODE_SEL(n)            ((n) << 2)   // P05 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P04_MODE_SEL(n)            ((n) << 0)   // P04 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           | 
|        |--------------------------------------------------------------------------------|
| P1_MD0 | 7:6 | P13 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 5:4 | P12 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 3:2 | P11 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P10 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P1_MD0
#define _P1_MD0
#define GPIO_P13_MODE_SEL(n)            ((n) << 6)   // P13 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P12_MODE_SEL(n)            ((n) << 4)   // P12 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P11_MODE_SEL(n)            ((n) << 2)   // P11 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P10_MODE_SEL(n)            ((n) << 0)   // P10 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           |
|        |--------------------------------------------------------------------------------|
| P1_MD1 | 7:6 | P17 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 5:4 | P16 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 3:2 | P15 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P14 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P1_MD1
#define _P1_MD1
#define GPIO_P17_MODE_SEL(n)            ((n) << 6)   // P17 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P16_MODE_SEL(n)            ((n) << 4)   // P16 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P15_MODE_SEL(n)            ((n) << 2)   // P15 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P14_MODE_SEL(n)            ((n) << 0)   // P14 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           | 
|        |--------------------------------------------------------------------------------|
| P2_MD0 | 7:6 | P23 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 5:4 | P22 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 3:2 | P21 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P20 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P2_MD0
#define _P2_MD0
#define GPIO_P23_MODE_SEL(n)            ((n) << 6)   // P23 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P22_MODE_SEL(n)            ((n) << 4)   // P22 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P21_MODE_SEL(n)            ((n) << 2)   // P21 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P20_MODE_SEL(n)            ((n) << 0)   // P20 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           |
|        |--------------------------------------------------------------------------------|
| P2_MD1 | 7:6 | P27 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 5:4 | P26 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 3:2 | P25 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P24 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P2_MD1
#define _P2_MD1
#define GPIO_P27_MODE_SEL(n)            ((n) << 6)   // P27 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P26_MODE_SEL(n)            ((n) << 4)   // P26 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P25_MODE_SEL(n)            ((n) << 2)   // P25 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P24_MODE_SEL(n)            ((n) << 0)   // P24 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|        | Bit |                    Description                                           | 
|        |--------------------------------------------------------------------------------|
| P3_MD0 | 3:2 | P31 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|        | 1:0 | P30 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作 |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// P3_MD0
#define _P3_MD0
#define GPIO_P31_MODE_SEL(n)            ((n) << 2)   // P31 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作
#define GPIO_P30_MODE_SEL(n)            ((n) << 0)   // P30 模式控制位  0x0:输入  0x1:输出  0x2:数字功能复用选择  0x3:模拟IO工作

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|        |  7  | P07 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择 |
|        |  6  | P06 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择 |
|        |  5  | P05 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择 |
|        |  4  | P04 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SDA功能选择 |
| P0_AF0 |  3  | P03 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SCL功能选择 |
|        |  2  | P02 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择 |
|        |  1  | P01 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择 |
|        |  0  | P00 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择 |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P0_AF0
#define _P0_AF0
#define GPIO_P07_FUNC_SEL(n)            ((n) << 7)   // P07 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P06_FUNC_SEL(n)            ((n) << 6)   // P06 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择
#define GPIO_P05_FUNC_SEL(n)            ((n) << 5)   // P05 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P04_FUNC_SEL(n)            ((n) << 4)   // P04 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SDA功能选择
#define GPIO_P03_FUNC_SEL(n)            ((n) << 3)   // P03 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SCL功能选择
#define GPIO_P02_FUNC_SEL(n)            ((n) << 2)   // P02 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择
#define GPIO_P01_FUNC_SEL(n)            ((n) << 1)   // P01 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P00_FUNC_SEL(n)            ((n) << 0)   // P00 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|        |  7  | P17 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择 |
|        |  6  | P16 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择 |
|        |  5  | P15 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择 |
|        |  4  | P14 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择 |
| P1_AF0 |  3  | P13 数字外设功能复用选择配置  0x0:I2C_SCL功能选择        0x1:I2C_SDA功能选择 |
|        |  2  | P12 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择 |
|        |  1  | P11 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择 |
|        |  0  | P10 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择 |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P1_AF0
#define _P1_AF0
#define GPIO_P17_FUNC_SEL(n)            ((n) << 7)   // P17 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择
#define GPIO_P16_FUNC_SEL(n)            ((n) << 6)   // P16 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择
#define GPIO_P15_FUNC_SEL(n)            ((n) << 5)   // P15 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P14_FUNC_SEL(n)            ((n) << 4)   // P14 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择
#define GPIO_P13_FUNC_SEL(n)            ((n) << 3)   // P13 数字外设功能复用选择配置  0x0:I2C_SCL功能选择        0x1:I2C_SDA功能选择
#define GPIO_P12_FUNC_SEL(n)            ((n) << 2)   // P12 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P11_FUNC_SEL(n)            ((n) << 1)   // P11 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择
#define GPIO_P10_FUNC_SEL(n)            ((n) << 0)   // P10 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|        |  7  | P27 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择 |
|        |  6  | P26 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SDA功能选择 |
|        |  5  | P25 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SCL功能选择 |
|        |  4  | P24 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择 |
| P2_AF0 |  3  | P23 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择 |
|        |  2  | P22 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择 |
|        |  1  | P21 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择 |
|        |  0  | P20 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择 |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P2_AF0
#define _P2_AF0
#define GPIO_P27_FUNC_SEL(n)            ((n) << 7)   // P27 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P26_FUNC_SEL(n)            ((n) << 6)   // P26 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SDA功能选择
#define GPIO_P25_FUNC_SEL(n)            ((n) << 5)   // P25 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SCL功能选择
#define GPIO_P24_FUNC_SEL(n)            ((n) << 4)   // P24 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SDA功能选择
#define GPIO_P23_FUNC_SEL(n)            ((n) << 3)   // P23 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P22_FUNC_SEL(n)            ((n) << 2)   // P22 数字外设功能复用选择配置  0x0:SPI_CLK功能选择        0x1:I2C_SDA功能选择
#define GPIO_P21_FUNC_SEL(n)            ((n) << 1)   // P21 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P20_FUNC_SEL(n)            ((n) << 0)   // P20 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SCL功能选择

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
| P3_AF0 | 7:2 |                                                                              |
|        |  1  | P31 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择 |
|        |  0  | P30 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SDA功能选择 |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P3_AF0
#define _P3_AF0
#define GPIO_P31_FUNC_SEL(n)            ((n) << 1)   // P31 数字外设功能复用选择配置  0x0:SPI_MISO(IO1)功能选择  0x1:I2C_SCL功能选择
#define GPIO_P30_FUNC_SEL(n)            ((n) << 0)   // P30 数字外设功能复用选择配置  0x0:SPI_MOSI(IO0)功能选择  0x1:I2C_SDA功能选择

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P0_TRG0 | 7:6 | P03 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 5:4 | P02 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 3:2 | P01 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P00 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P0_TRG0
#define _P0_TRG0
#define GPIO_P03_TRG_SEL(n)             ((n) << 6)   // P03 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P02_TRG_SEL(n)             ((n) << 4)   // P02 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P01_TRG_SEL(n)             ((n) << 2)   // P01 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P00_TRG_SEL(n)             ((n) << 0)   // P00 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P0_TRG1 | 7:6 | P07 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 5:4 | P06 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 3:2 | P05 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P04 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P0_TRG1
#define _P0_TRG1
#define GPIO_P07_TRG_SEL(n)             ((n) << 6)   // P07 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P06_TRG_SEL(n)             ((n) << 4)   // P06 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P05_TRG_SEL(n)             ((n) << 2)   // P05 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P04_TRG_SEL(n)             ((n) << 0)   // P04 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P1_TRG0 | 7:6 | P13 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 5:4 | P12 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 3:2 | P11 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P10 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P1_TRG0
#define _P1_TRG0
#define GPIO_P13_TRG_SEL(n)             ((n) << 6)   // P13 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P12_TRG_SEL(n)             ((n) << 4)   // P12 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P11_TRG_SEL(n)             ((n) << 2)   // P11 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P10_TRG_SEL(n)             ((n) << 0)   // P10 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P1_TRG1 | 7:6 | P17 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 5:4 | P16 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 3:2 | P15 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P14 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P1_TRG1
#define _P1_TRG1
#define GPIO_P17_TRG_SEL(n)             ((n) << 6)   // P17 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P16_TRG_SEL(n)             ((n) << 4)   // P16 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P15_TRG_SEL(n)             ((n) << 2)   // P15 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P14_TRG_SEL(n)             ((n) << 0)   // P14 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P2_TRG0 | 7:6 | P23 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 5:4 | P22 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 3:2 | P21 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P20 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P2_TRG0
#define _P2_TRG0
#define GPIO_P23_TRG_SEL(n)             ((n) << 6)   // P23 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P22_TRG_SEL(n)             ((n) << 4)   // P22 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P21_TRG_SEL(n)             ((n) << 2)   // P21 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P20_TRG_SEL(n)             ((n) << 0)   // P20 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P2_TRG1 | 7:6 | P27 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 5:4 | P26 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 3:2 | P25 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P24 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P2_TRG1
#define _P2_TRG1
#define GPIO_P27_TRG_SEL(n)             ((n) << 6)   // P27 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P26_TRG_SEL(n)             ((n) << 4)   // P26 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P25_TRG_SEL(n)             ((n) << 2)   // P25 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P24_TRG_SEL(n)             ((n) << 0)   // P24 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/**********************************************************************************************
|---------------------------------------------------------------------------------------------|
|        | Bit |                    Description                                               |
|        |------------------------------------------------------------------------------------|
|P3_TRG0 | 3:2 | P31 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|        | 1:0 | P30 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿       |
|---------------------------------------------------------------------------------------------|
**********************************************************************************************/
// P3_TRG0
#define _P3_TRG0
#define GPIO_P31_TRG_SEL(n)             ((n) << 2)   // P31 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿
#define GPIO_P30_TRG_SEL(n)             ((n) << 0)   // P30 中断触发配置寄存器  0x0:双边沿  0x1:下降沿  0x2:上升沿  0x3:双边沿

/*******************************************************************************
|------------------------------------------------------------------------------|
|        | Bit |                    Description                                |
|        |---------------------------------------------------------------------|
|        |  7  | P07 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  6  | P06 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  5  | P05 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
| P0_PND |  4  | P04 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  3  | P03 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  2  | P02 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  1  | P01 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  0  | P00 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|-----------------------------------------------------------------------------—|
|        |     | Note:CPU 写 P0_PND 操作,则清掉P00~P07所有的中断标志位         |
|-----------------------------------------------------------------------------—|
*******************************************************************************/
// P0_PND
#define _P0_PND
#define GPIO_P07_IRQ_PNG(n)             ((n) << 7)   // P07 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P06_IRQ_PNG(n)             ((n) << 6)   // P06 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P05_IRQ_PNG(n)             ((n) << 5)   // P05 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P04_IRQ_PNG(n)             ((n) << 4)   // P04 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P03_IRQ_PNG(n)             ((n) << 3)   // P03 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P02_IRQ_PNG(n)             ((n) << 2)   // P02 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P01_IRQ_PNG(n)             ((n) << 1)   // P01 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P00_IRQ_PNG(n)             ((n) << 0)   // P00 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING

/*******************************************************************************
|------------------------------------------------------------------------------|
|        | Bit |                    Description                                |
|        |---------------------------------------------------------------------|
|        |  7  | P17 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  6  | P16 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  5  | P15 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
| P1_PND |  4  | P14 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  3  | P13 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  2  | P12 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  1  | P11 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  0  | P10 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|-----------------------------------------------------------------------------—|
|        |     | Note:CPU 写 P1_PND 操作,则清掉P10~P17所有的中断标志位         |
|-----------------------------------------------------------------------------—|
*******************************************************************************/
// P1_PND
#define _P1_PND
#define GPIO_P17_IRQ_PNG(n)             ((n) << 7)   // P17 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P16_IRQ_PNG(n)             ((n) << 6)   // P16 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P15_IRQ_PNG(n)             ((n) << 5)   // P15 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P14_IRQ_PNG(n)             ((n) << 4)   // P14 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P13_IRQ_PNG(n)             ((n) << 3)   // P13 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P12_IRQ_PNG(n)             ((n) << 2)   // P12 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P11_IRQ_PNG(n)             ((n) << 1)   // P11 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P10_IRQ_PNG(n)             ((n) << 0)   // P10 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING

/*******************************************************************************
|------------------------------------------------------------------------------|
|        | Bit |                    Description                                |
|        |---------------------------------------------------------------------|
|        |  7  | P27 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  6  | P26 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  5  | P25 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
| P2_PND |  4  | P24 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  3  | P23 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  2  | P22 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  1  | P21 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  0  | P20 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|-----------------------------------------------------------------------------—|
|        |     | Note:CPU 写 P2_PND 操作,则清掉P20~P27所有的中断标志位         |
|-----------------------------------------------------------------------------—|
*******************************************************************************/
// P2_PND
#define _P2_PND
#define GPIO_P27_IRQ_PNG(n)             ((n) << 7)   // P27 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P26_IRQ_PNG(n)             ((n) << 6)   // P26 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P25_IRQ_PNG(n)             ((n) << 5)   // P25 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P24_IRQ_PNG(n)             ((n) << 4)   // P24 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P23_IRQ_PNG(n)             ((n) << 3)   // P23 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P22_IRQ_PNG(n)             ((n) << 2)   // P22 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P21_IRQ_PNG(n)             ((n) << 1)   // P21 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P20_IRQ_PNG(n)             ((n) << 0)   // P20 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING

/*******************************************************************************
|------------------------------------------------------------------------------|
|        | Bit |                    Description                                |
|        |---------------------------------------------------------------------|
| P3_PND |  1  | P31 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|        |  0  | P30 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING |
|-----------------------------------------------------------------------------—|
|        |     | Note:CPU 写 P3_PND 操作,则清掉P30~P31所有的中断标志位         |
|-----------------------------------------------------------------------------—|
*******************************************************************************/
// P3_PND
#define _P3_PND
#define GPIO_P31_IRQ_PNG(n)             ((n) << 1)   // P31 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING
#define GPIO_P30_IRQ_PNG(n)             ((n) << 0)   // P30 中断PENDING寄存器  0x0:没有中断PENDING  0x1:有中断PENDING

/************************************************************************************
|-----------------------------------------------------------------------------------|
|        | Bit |                    Description                                     |
|        |--------------------------------------------------------------------------|
|        |  7  | P07 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  6  | P06 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  5  | P05 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
| P0_IMK |  4  | P04 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  3  | P03 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  2  | P02 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  1  | P01 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  0  | P00 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|----------------------------------------------------------------------------------—|
************************************************************************************/
// P0_IMK
#define _P0_IMK
#define GPIO_P07_IRQ_MASK(n)            ((n) << 7)   // P07 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P06_IRQ_MASK(n)            ((n) << 6)   // P06 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P05_IRQ_MASK(n)            ((n) << 5)   // P05 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P04_IRQ_MASK(n)            ((n) << 4)   // P04 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P03_IRQ_MASK(n)            ((n) << 3)   // P03 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P02_IRQ_MASK(n)            ((n) << 2)   // P02 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P01_IRQ_MASK(n)            ((n) << 1)   // P01 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P00_IRQ_MASK(n)            ((n) << 0)   // P00 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能

/************************************************************************************
|-----------------------------------------------------------------------------------|
|        | Bit |                    Description                                     |
|        |--------------------------------------------------------------------------|
|        |  7  | P17 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  6  | P16 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  5  | P15 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
| P1_IMK |  4  | P14 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  3  | P13 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  2  | P12 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  1  | P11 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  0  | P10 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|----------------------------------------------------------------------------------—|
************************************************************************************/
// P1_IMK
#define _P1_IMK
#define GPIO_P17_IRQ_MASK(n)            ((n) << 7)   // P17 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P16_IRQ_MASK(n)            ((n) << 6)   // P16 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P15_IRQ_MASK(n)            ((n) << 5)   // P15 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P14_IRQ_MASK(n)            ((n) << 4)   // P14 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P13_IRQ_MASK(n)            ((n) << 3)   // P13 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P12_IRQ_MASK(n)            ((n) << 2)   // P12 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P11_IRQ_MASK(n)            ((n) << 1)   // P11 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P10_IRQ_MASK(n)            ((n) << 0)   // P10 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能

/************************************************************************************
|-----------------------------------------------------------------------------------|
|        | Bit |                    Description                                     |
|        |--------------------------------------------------------------------------|
|        |  7  | P27 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  6  | P26 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  5  | P25 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
| P2_IMK |  4  | P24 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  3  | P23 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  2  | P22 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  1  | P21 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  0  | P20 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|----------------------------------------------------------------------------------—|
************************************************************************************/
// P2_IMK
#define _P2_IMK
#define GPIO_P27_IRQ_MASK(n)            ((n) << 7)   // P27 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P26_IRQ_MASK(n)            ((n) << 6)   // P26 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P25_IRQ_MASK(n)            ((n) << 5)   // P25 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P24_IRQ_MASK(n)            ((n) << 4)   // P24 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P23_IRQ_MASK(n)            ((n) << 3)   // P23 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P22_IRQ_MASK(n)            ((n) << 2)   // P22 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P21_IRQ_MASK(n)            ((n) << 1)   // P21 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P20_IRQ_MASK(n)            ((n) << 0)   // P20 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能


/************************************************************************************
|-----------------------------------------------------------------------------------|
|        | Bit |                    Description                                     |
|        |--------------------------------------------------------------------------|
| P3_IMK |  1  | P31 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|        |  0  | P30 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能 |
|----------------------------------------------------------------------------------—|
************************************************************************************/
// P3_IMK
#define _P3_IMK
#define GPIO_P31_IRQ_MASK(n)            ((n) << 1)   // P31 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能
#define GPIO_P30_IRQ_MASK(n)            ((n) << 0)   // P30 中断屏蔽寄存器  0x0:屏蔽IO中断触发功能  0x1:打开IO中断触发功能

/***************************************************************
|--------------------------------------------------------------|
|        | Bit |                    Description                |
|        |-----------------------------------------------------|
|        |  7  | P07 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  6  | P06 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  5  | P05 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|P0_AIOEN|  4  | P04 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  3  | P03 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  2  | P02 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  1  | P01 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  0  | P00 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|-----------------------------------------------------------—-—|
***************************************************************/
// P0_AIOEN
#define _P0_AIOEN
#define GPIO_P07_ANALOG_EN(n)           ((n) << 7)   // P07 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P06_ANALOG_EN(n)           ((n) << 6)   // P06 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P05_ANALOG_EN(n)           ((n) << 5)   // P05 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P04_ANALOG_EN(n)           ((n) << 4)   // P04 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P03_ANALOG_EN(n)           ((n) << 3)   // P03 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P02_ANALOG_EN(n)           ((n) << 2)   // P02 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P01_ANALOG_EN(n)           ((n) << 1)   // P01 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P00_ANALOG_EN(n)           ((n) << 0)   // P00 模拟IO功能使能位  0x0:不使能  0x1:使能

/***************************************************************
|--------------------------------------------------------------|
|        | Bit |                    Description                |
|        |-----------------------------------------------------|
|        |  7  | P17 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  6  | P16 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  5  | P15 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|P1_AIOEN|  4  | P14 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  3  | P13 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  2  | P12 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  1  | P11 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  0  | P10 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|-----------------------------------------------------------—-—|
***************************************************************/
// P1_AIOEN
#define _P1_AIOEN
#define GPIO_P17_ANALOG_EN(n)           ((n) << 7)   // P17 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P16_ANALOG_EN(n)           ((n) << 6)   // P16 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P15_ANALOG_EN(n)           ((n) << 5)   // P15 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P14_ANALOG_EN(n)           ((n) << 4)   // P14 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P13_ANALOG_EN(n)           ((n) << 3)   // P13 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P12_ANALOG_EN(n)           ((n) << 2)   // P12 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P11_ANALOG_EN(n)           ((n) << 1)   // P11 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P10_ANALOG_EN(n)           ((n) << 0)   // P10 模拟IO功能使能位  0x0:不使能  0x1:使能

/***************************************************************
|--------------------------------------------------------------|
|        | Bit |                    Description                |
|        |-----------------------------------------------------|
|        |  7  | P27 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  6  | P26 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  5  | P25 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|P2_AIOEN|  4  | P24 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  3  | P23 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  2  | P22 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  1  | P21 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  0  | P20 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|-----------------------------------------------------------—-—|
***************************************************************/
// P2_AIOEN
#define _P2_AIOEN
#define GPIO_P27_ANALOG_EN(n)           ((n) << 7)   // P27 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P26_ANALOG_EN(n)           ((n) << 6)   // P26 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P25_ANALOG_EN(n)           ((n) << 5)   // P25 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P24_ANALOG_EN(n)           ((n) << 4)   // P24 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P23_ANALOG_EN(n)           ((n) << 3)   // P23 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P22_ANALOG_EN(n)           ((n) << 2)   // P22 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P21_ANALOG_EN(n)           ((n) << 1)   // P21 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P20_ANALOG_EN(n)           ((n) << 0)   // P20 模拟IO功能使能位  0x0:不使能  0x1:使能

/***************************************************************
|--------------------------------------------------------------|
|        | Bit |                    Description                |
|        |-----------------------------------------------------|
|P3_AIOEN|  1  | P31 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|        |  0  | P30 模拟IO功能使能位  0x0:不使能  0x1:使能    |
|-----------------------------------------------------------—-—|
***************************************************************/
// P3_AIOEN
#define _P3_AIOEN
#define GPIO_P31_ANALOG_EN(n)           ((n) << 1)   // P31 模拟IO功能使能位  0x0:不使能  0x1:使能
#define GPIO_P30_ANALOG_EN(n)           ((n) << 0)   // P30 模拟IO功能使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|         |  7  | P07 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  6  | P06 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  5  | P05 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|P0_AIOEN1|  4  | P04 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  3  | P03 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  2  | P02 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  1  | P01 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  0  | P00 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------—-——|
*****************************************************************/
// P0_AIOEN1
#define _P0_AIOEN1
#define GPIO_P07_ANALOG_1_EN(n)         ((n) << 7)   // P07 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P06_ANALOG_1_EN(n)         ((n) << 6)   // P06 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P05_ANALOG_1_EN(n)         ((n) << 5)   // P05 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P04_ANALOG_1_EN(n)         ((n) << 4)   // P04 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P03_ANALOG_1_EN(n)         ((n) << 3)   // P03 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P02_ANALOG_1_EN(n)         ((n) << 2)   // P02 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P01_ANALOG_1_EN(n)         ((n) << 1)   // P01 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P00_ANALOG_1_EN(n)         ((n) << 0)   // P00 模拟IO功能1使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|         |  7  | P17 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  6  | P16 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  5  | P15 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|P1_AIOEN1|  4  | P14 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  3  | P13 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  2  | P12 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  1  | P11 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  0  | P10 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------——-—|
******************************************************************/
// P1_AIOEN1
#define _P1_AIOEN1
#define GPIO_P17_ANALOG_1_EN(n)         ((n) << 7)   // P17 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P16_ANALOG_1_EN(n)         ((n) << 6)   // P16 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P15_ANALOG_1_EN(n)         ((n) << 5)   // P15 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P14_ANALOG_1_EN(n)         ((n) << 4)   // P14 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P13_ANALOG_1_EN(n)         ((n) << 3)   // P13 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P12_ANALOG_1_EN(n)         ((n) << 2)   // P12 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P11_ANALOG_1_EN(n)         ((n) << 1)   // P11 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P10_ANALOG_1_EN(n)         ((n) << 0)   // P10 模拟IO功能1使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|         |  7  | P27 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  6  | P26 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  5  | P25 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|P2_AIOEN1|  4  | P24 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  3  | P23 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  2  | P22 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  1  | P21 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  0  | P20 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------——-—|
*****************************************************************/
// P2_AIOEN1
#define _P2_AIOEN1
#define GPIO_P27_ANALOG_1_EN(n)         ((n) << 7)   // P27 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P26_ANALOG_1_EN(n)         ((n) << 6)   // P26 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P25_ANALOG_1_EN(n)         ((n) << 5)   // P25 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P24_ANALOG_1_EN(n)         ((n) << 4)   // P24 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P23_ANALOG_1_EN(n)         ((n) << 3)   // P23 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P22_ANALOG_1_EN(n)         ((n) << 2)   // P22 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P21_ANALOG_1_EN(n)         ((n) << 1)   // P21 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P20_ANALOG_1_EN(n)         ((n) << 0)   // P20 模拟IO功能1使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|P3_AIOEN1|  1  | P31 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|         |  0  | P30 模拟IO功能1使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------—-——|
*****************************************************************/
// P3_AIOEN1
#define _P3_AIOEN1
#define GPIO_P31_ANALOG_1_EN(n)         ((n) << 1)   // P31 模拟IO功能1使能位  0x0:不使能  0x1:使能
#define GPIO_P30_ANALOG_1_EN(n)         ((n) << 0)   // P30 模拟IO功能1使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|         |  7  | P07 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  6  | P06 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  5  | P05 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|P0_AIOEN2|  4  | P04 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  3  | P03 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  2  | P02 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  1  | P01 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  0  | P00 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------—-——|
*****************************************************************/
// P0_AIOEN2
#define _P0_AIOEN2
#define GPIO_P07_ANALOG_2_EN(n)         ((n) << 7)   // P07 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P06_ANALOG_2_EN(n)         ((n) << 6)   // P06 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P05_ANALOG_2_EN(n)         ((n) << 5)   // P05 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P04_ANALOG_2_EN(n)         ((n) << 4)   // P04 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P03_ANALOG_2_EN(n)         ((n) << 3)   // P03 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P02_ANALOG_2_EN(n)         ((n) << 2)   // P02 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P01_ANALOG_2_EN(n)         ((n) << 1)   // P01 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P00_ANALOG_2_EN(n)         ((n) << 0)   // P00 模拟IO功能2使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|         |  7  | P17 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  6  | P16 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  5  | P15 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|P1_AIOEN2|  4  | P14 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  3  | P13 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  2  | P12 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  1  | P11 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  0  | P10 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------——-—|
******************************************************************/
// P1_AIOEN2
#define _P1_AIOEN2
#define GPIO_P17_ANALOG_2_EN(n)         ((n) << 7)   // P17 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P16_ANALOG_2_EN(n)         ((n) << 6)   // P16 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P15_ANALOG_2_EN(n)         ((n) << 5)   // P15 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P14_ANALOG_2_EN(n)         ((n) << 4)   // P14 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P13_ANALOG_2_EN(n)         ((n) << 3)   // P13 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P12_ANALOG_2_EN(n)         ((n) << 2)   // P12 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P11_ANALOG_2_EN(n)         ((n) << 1)   // P11 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P10_ANALOG_2_EN(n)         ((n) << 0)   // P10 模拟IO功能2使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|         |  7  | P27 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  6  | P26 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  5  | P25 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|P2_AIOEN2|  4  | P24 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  3  | P23 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  2  | P22 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  1  | P21 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  0  | P20 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------——-—|
*****************************************************************/
// P2_AIOEN2
#define _P2_AIOEN2
#define GPIO_P27_ANALOG_2_EN(n)         ((n) << 7)   // P27 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P26_ANALOG_2_EN(n)         ((n) << 6)   // P26 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P25_ANALOG_2_EN(n)         ((n) << 5)   // P25 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P24_ANALOG_2_EN(n)         ((n) << 4)   // P24 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P23_ANALOG_2_EN(n)         ((n) << 3)   // P23 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P22_ANALOG_2_EN(n)         ((n) << 2)   // P22 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P21_ANALOG_2_EN(n)         ((n) << 1)   // P21 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P20_ANALOG_2_EN(n)         ((n) << 0)   // P20 模拟IO功能2使能位  0x0:不使能  0x1:使能

/*****************************************************************
|----------------------------------------------------------------|
|         | Bit |                    Description                 |
|         |------------------------------------------------------|
|P3_AIOEN2|  1  | P31 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|         |  0  | P30 模拟IO功能2使能位  0x0:不使能  0x1:使能    |
|------------------------------------------------------------—-——|
*****************************************************************/
// P3_AIOEN2
#define _P3_AIOEN2
#define GPIO_P31_ANALOG_2_EN(n)         ((n) << 1)   // P31 模拟IO功能2使能位  0x0:不使能  0x1:使能
#define GPIO_P30_ANALOG_2_EN(n)         ((n) << 0)   // P30 模拟IO功能2使能位  0x0:不使能  0x1:使能

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV0 | 4:0 | P00 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV0
#define _P0_DRV0
#define GPIO_P00_DRV_SEL(n)             ((n) << 0)   // P00 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV1 | 4:0 | P01 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV1
#define _P0_DRV1
#define GPIO_P01_DRV_SEL(n)             ((n) << 0)   // P01 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV2 | 4:0 | P02 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV2
#define _P0_DRV2
#define GPIO_P02_DRV_SEL(n)             ((n) << 0)   // P02 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV3 | 4:0 | P03 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV3
#define _P0_DRV3
#define GPIO_P03_DRV_SEL(n)             ((n) << 0)   // P03 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV4 | 4:0 | P04 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV4
#define _P0_DRV4
#define GPIO_P04_DRV_SEL(n)             ((n) << 0)   // P04 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV5 | 4:0 | P05 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV5
#define _P0_DRV5
#define GPIO_P05_DRV_SEL(n)             ((n) << 0)   // P05 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV6 | 4:0 | P06 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV6
#define _P0_DRV6
#define GPIO_P06_DRV_SEL(n)             ((n) << 0)   // P06 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P0_DRV7 | 4:0 | P07 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P0_DRV7
#define _P0_DRV7
#define GPIO_P07_DRV_SEL(n)             ((n) << 0)   // P07 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV0 | 4:0 | P10 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV0
#define _P1_DRV0
#define GPIO_P10_DRV_SEL(n)             ((n) << 0)   // P10 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV1 | 4:0 | P11 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV1
#define _P1_DRV1
#define GPIO_P11_DRV_SEL(n)             ((n) << 0)   // P11 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:5 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV2 | 4:0 | P12 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV2
#define _P1_DRV2
#define GPIO_P12_DRV_SEL(n)             ((n) << 0)   // P12 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV3 | 4:0 | P13 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV3
#define _P1_DRV3
#define GPIO_P13_DRV_SEL(n)             ((n) << 0)   // P13 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV4 | 4:0 | P14 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV4
#define _P1_DRV4
#define GPIO_P14_DRV_SEL(n)             ((n) << 0)   // P14 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV5 | 4:0 | P15 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV5
#define _P1_DRV5
#define GPIO_P15_DRV_SEL(n)             ((n) << 0)   // P15 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV6 | 4:0 | P16 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV6
#define _P1_DRV6
#define GPIO_P16_DRV_SEL(n)             ((n) << 0)   // P16 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P1_DRV7 | 4:0 | P17 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P1_DRV7
#define _P1_DRV7
#define GPIO_P17_DRV_SEL(n)             ((n) << 0)   // P17 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV0 | 4:0 | P20 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV0
#define _P2_DRV0
#define GPIO_P20_DRV_SEL(n)             ((n) << 0)   // P20 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV1 | 4:0 | P21 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV1
#define _P2_DRV1
#define GPIO_P21_DRV_SEL(n)             ((n) << 0)   // P21 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV2 | 4:0 | P22 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV2
#define _P2_DRV2
#define GPIO_P22_DRV_SEL(n)             ((n) << 0)   // P22 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV3 | 4:0 | P23 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV3
#define _P2_DRV3
#define GPIO_P23_DRV_SEL(n)             ((n) << 0)   // P23 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV4 | 4:0 | P24 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV4
#define _P2_DRV4
#define GPIO_P24_DRV_SEL(n)             ((n) << 0)   // P24 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV5 | 4:0 | P25 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV5
#define _P2_DRV5
#define GPIO_P25_DRV_SEL(n)             ((n) << 0)   // P25 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV6 | 4:0 | P26 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV6
#define _P2_DRV6
#define GPIO_P26_DRV_SEL(n)             ((n) << 0)   // P26 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P2_DRV7 | 4:0 | P27 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P2_DRV7
#define _P2_DRV7
#define GPIO_P27_DRV_SEL(n)             ((n) << 0)   // P27 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P3_DRV0 | 4:0 | P30 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P3_DRV0
#define _P3_DRV0
#define GPIO_P30_DRV_SEL(n)             ((n) << 0)   // P30 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/**************************************************************************************
|-------------------------------------------------------------------------------------|
|         | Bit |                    Description                                      |
|         |---------------------------------------------------------------------------|
|         | 7:6 |                                                                     |
|         |---------------------------------------------------------------------------|
| P3_DRV1 | 4:0 | P31 驱动电流配置寄存器                                              |
|         |     | 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA |
|-------------------------------------------------------------------------------------|
**************************************************************************************/
// P3_DRV1
#define _P3_DRV1
#define GPIO_P31_DRV_SEL(n)             ((n) << 0)   // P31 驱动电流配置寄存器
                                                     // 0x0: 4mA  0x1:8mA  0x2 :12mA  0x3:16mA  0x4:20mA  ......  0x1F:64mA

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
|         |  7  | P07 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  6  | P06 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  5  | P05 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
| P0_ODN  |  4  | P04 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  3  | P03 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  2  | P02 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  1  | P01 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  0  | P00 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P0_ODN
#define _P0_ODN
#define GPIO_P07_ODN_EN(n)              ((n) << 7)   // P07 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P06_ODN_EN(n)              ((n) << 6)   // P06 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P05_ODN_EN(n)              ((n) << 5)   // P05 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P04_ODN_EN(n)              ((n) << 4)   // P04 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P03_ODN_EN(n)              ((n) << 3)   // P03 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P02_ODN_EN(n)              ((n) << 2)   // P02 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P01_ODN_EN(n)              ((n) << 1)   // P01 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P00_ODN_EN(n)              ((n) << 0)   // P00 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
|         |  7  | P17 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  6  | P16 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  5  | P15 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
| P1_ODN  |  4  | P14 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  3  | P13 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  2  | P12 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  1  | P11 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  0  | P10 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P1_ODN
#define _P1_ODN
#define GPIO_P17_ODN_EN(n)              ((n) << 7)   // P17 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P16_ODN_EN(n)              ((n) << 6)   // P16 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P15_ODN_EN(n)              ((n) << 5)   // P15 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P14_ODN_EN(n)              ((n) << 4)   // P14 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P13_ODN_EN(n)              ((n) << 3)   // P13 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P12_ODN_EN(n)              ((n) << 2)   // P12 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P11_ODN_EN(n)              ((n) << 1)   // P11 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P10_ODN_EN(n)              ((n) << 0)   // P10 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
|         |  7  | P27 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  6  | P26 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  5  | P25 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
| P2_ODN  |  4  | P24 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  3  | P23 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  2  | P22 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  1  | P21 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  0  | P20 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P2_ODN
#define _P2_ODN
#define GPIO_P27_ODN_EN(n)              ((n) << 7)   // P27 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P26_ODN_EN(n)              ((n) << 6)   // P26 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P25_ODN_EN(n)              ((n) << 5)   // P25 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P24_ODN_EN(n)              ((n) << 4)   // P24 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P23_ODN_EN(n)              ((n) << 3)   // P23 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P22_ODN_EN(n)              ((n) << 2)   // P22 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P21_ODN_EN(n)              ((n) << 1)   // P21 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P20_ODN_EN(n)              ((n) << 0)   // P20 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
| P3_ODN  |  1  | P31 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|         |  0  | P30 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P3_ODN
#define _P3_ODN
#define GPIO_P31_ODN_EN(n)              ((n) << 1)   // P31 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)
#define GPIO_P30_ODN_EN(n)              ((n) << 0)   // P30 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=0时输出1;DIN_VDD=1时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
|         |  7  | P07 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  6  | P06 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  5  | P05 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
| P0_ODP  |  4  | P04 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  3  | P03 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  2  | P02 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  1  | P01 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  0  | P00 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P0_ODP
#define _P0_ODP
#define GPIO_P07_ODP_EN(n)              ((n) << 7)   // P07 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P06_ODP_EN(n)              ((n) << 6)   // P06 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P05_ODP_EN(n)              ((n) << 5)   // P05 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P04_ODP_EN(n)              ((n) << 4)   // P04 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P03_ODP_EN(n)              ((n) << 3)   // P03 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P02_ODP_EN(n)              ((n) << 2)   // P02 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P01_ODP_EN(n)              ((n) << 1)   // P01 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P00_ODP_EN(n)              ((n) << 0)   // P00 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
|         |  7  | P17 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  6  | P16 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  5  | P15 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
| P1_ODP  |  4  | P14 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  3  | P13 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  2  | P12 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  1  | P11 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  0  | P10 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P1_ODP
#define _P1_ODP
#define GPIO_P17_ODP_EN(n)              ((n) << 7)   // P17 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P16_ODP_EN(n)              ((n) << 6)   // P16 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P15_ODP_EN(n)              ((n) << 5)   // P15 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P14_ODP_EN(n)              ((n) << 4)   // P14 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P13_ODP_EN(n)              ((n) << 3)   // P13 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P12_ODP_EN(n)              ((n) << 2)   // P12 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P11_ODP_EN(n)              ((n) << 1)   // P11 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P10_ODP_EN(n)              ((n) << 0)   // P10 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
|         |  7  | P27 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  6  | P26 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  5  | P25 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
| P2_ODP  |  4  | P24 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  3  | P23 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  2  | P22 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  1  | P21 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  0  | P20 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P2_ODP
#define _P2_ODP
#define GPIO_P27_ODP_EN(n)              ((n) << 7)   // P27 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P26_ODP_EN(n)              ((n) << 6)   // P26 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P25_ODP_EN(n)              ((n) << 5)   // P25 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P24_ODP_EN(n)              ((n) << 4)   // P24 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P23_ODP_EN(n)              ((n) << 3)   // P23 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P22_ODP_EN(n)              ((n) << 2)   // P22 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P21_ODP_EN(n)              ((n) << 1)   // P21 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P20_ODP_EN(n)              ((n) << 0)   // P20 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)

/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                   |
|         |----------------------------------------------------------------------------------------|
| P3_ODP  |  1  | P31 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|         |  0  | P30 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态) |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/
// P3_ODP
#define _P3_ODP
#define GPIO_P31_ODP_EN(n)              ((n) << 1)   // P31 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)
#define GPIO_P30_ODP_EN(n)              ((n) << 0)   // P30 开漏功能使能位  0x0:不使能  0x1:使能(DIN_VDD=1时输出1;DIN_VDD=0时输出高阻态)

/****************************************************************************************
|---------------------------------------------------------------------------------------|
|           | Bit |                    Description                                      |
|           |---------------------------------------------------------------------------|
|           | 7:5 |                                                                     |
|           |---------------------------------------------------------------------------|
|           |     | P00~P07 / P10~P17 / P20~P27 / P30~P31 输出功能选择                  |
|           |     |    0x0 : 选择PT00AF功能输出                                         |
|           |     |    0x1 : 选择cmp1_dout_dig                                          |
| FOUT_S00/ |     |    0x2 : 选择cmp0_dout_dig                                          |
| FOUT_S01/ |     |    0x3 : 选择uart1_tx                                               |
| FOUT_S02/ |     |    0x4 : 选择uart0_tx                                               |
| FOUT_S03/ |     |    0x5 : 选择stmr5_pwmout or led_seg10(FOUTSEL[2]=1)                |
| FOUT_S04/ |     |    0x6 : 选择stmr4_pwmout or led_seg11(FOUTSEL[3]=1)                |
| FOUT_S05/ |     |    0x7 : 选择stmr3_pwmout or led_com6(FOUTSEL[4]=1)                 |
| FOUT_S06/ |     |    0x8 : 选择stmr2_pwmout or led_com7(FOUTSEL[5]=1)                 |
| FOUT_S07/ |     |    0x9 : 选择stmr1_pwmout                                           |
| FOUT_S10/ | 4:0 |    0xA : 选择stmr0_pwmout                                           |
| FOUT_S11/ |     |    0xB : 选择buz_out                                                |
| FOUT_S12/ |     |    0xC : 选择wut_pwm_o                                              |
| FOUT_S13/ |     |    0xD : 选择tmr4_pwm_o                                             |
| FOUT_S14/ |     |    0xE : 选择tmr3_pwm_o                                             |
| FOUT_S15/ |     |    0xF : 选择tmr2_pwm_o                                             |
| FOUT_S16/ |     |    0x10: 选择tmr1_pwm_o or led_seg9(FOUTSEL[1]=1)                   |
| FOUT_S17/ |     |    0x11: 选择tmr0_pwm_o or led_seg8(FOUTSEL[0]=1)                   |
| FOUT_S20/ |     |    0x12: 选择led_seg0                                               |
| FOUT_S21/ |     |    0x13: 选择led_seg1                                               |
| FOUT_S22/ |     |    0x14: 选择led_seg2                                               |
| FOUT_S23/ |     |    0x15: 选择led_seg3                                               |
| FOUT_S24/ |     |    0x16: 选择led_seg4                                               |
| FOUT_S25/ |     |    0x17: 选择led_seg5                                               |
| FOUT_S26/ |     |    0x18: 选择led_seg6                                               |
| FOUT_S27/ |     |    0x19: 选择led_seg7                                               |
| FOUT_S30/ |     |    0x1A: 选择led_com0                                               |
| FOUT_S31  |     |    0x1B: 选择led_com1                                               |
|           |     |    0x1C: 选择led_com2                                               |
|           |     |    0x1D: 选择led_com3                                               |
|           |     |    0x1E: 选择led_com4                                               |
|           |     |    0x1F: 选择led_com5                                               |
|---------------------------------------------------------------------------------------|
****************************************************************************************/
// FOUT_S00~FOUT_S07 / FOUT_S10~FOUT_S17 / FOUT_S20~FOUT_S27 / FOUT_S30~FOUT_S31
#define _FOUT_S00
#define _FOUT_S01
#define _FOUT_S02
#define _FOUT_S03
#define _FOUT_S04
#define _FOUT_S05
#define _FOUT_S06
#define _FOUT_S07
#define _FOUT_S10
#define _FOUT_S11
#define _FOUT_S12
#define _FOUT_S13
#define _FOUT_S14
#define _FOUT_S15
#define _FOUT_S16
#define _FOUT_S17
#define _FOUT_S20
#define _FOUT_S21
#define _FOUT_S22
#define _FOUT_S23
#define _FOUT_S24
#define _FOUT_S25
#define _FOUT_S26
#define _FOUT_S27
#define _FOUT_S30
#define _FOUT_S31

#define GPIO_FOUT_AF_FUNC               (0x0)        // 选择AF功能输出
#define GPIO_FOUT_CMP1_DOUT_DIG         (0x1)        // 选择cmp1_dout_dig 
#define GPIO_FOUT_CMP0_DOUT_DIG         (0x2)        // 选择cmp0_dout_dig 
#define GPIO_FOUT_UART1_TX              (0x3)        // 选择uart1_tx 
#define GPIO_FOUT_UART0_TX              (0x4)        // 选择uart0_tx 
#define GPIO_FOUT_STMR5_PWMOUT          (0x5)        // 选择stmr5_pwmout (注意配置 FOUT_SEL[2]=0)
#define GPIO_FOUT_LED_SEG10             (0x5)        // 选择led_seg10    (注意配置 FOUT_SEL[2]=1)
#define GPIO_FOUT_STMR4_PWMOUT          (0x6)        // 选择stmr4_pwmout (注意配置 FOUT_SEL[3]=0)
#define GPIO_FOUT_LED_SEG11             (0x6)        // 选择led_seg11    (注意配置 FOUT_SEL[3]=1)
#define GPIO_FOUT_STMR3_PWMOUT          (0x7)        // 选择stmr3_pwmout (注意配置 FOUT_SEL[4]=0)
#define GPIO_FOUT_LED_COM6              (0x7)        // 选择led_com6     (注意配置 FOUT_SEL[4]=1)
#define GPIO_FOUT_STMR2_PWMOUT          (0x8)        // 选择stmr2_pwmout (注意配置 FOUT_SEL[5]=0)
#define GPIO_FOUT_LED_COM7              (0x8)        // 选择led_com7     (注意配置 FOUT_SEL[5]=1)
#define GPIO_FOUT_STMR1_PWMOUT          (0x9)        // 选择stmr1_pwmout 
#define GPIO_FOUT_STMR0_PWMOUT          (0xA)        // 选择stmr0_pwmout 
#define GPIO_FOUT_BUZ_PWMOUT            (0xB)        // 选择buz_out 
#define GPIO_FOUT_WUT_PWMOUT            (0xC)        // 选择wut_pwm_o 
#define GPIO_FOUT_TMR4_PWMOUT           (0xD)        // 选择tmr4_pwm_o 
#define GPIO_FOUT_TMR3_PWMOUT           (0xE)        // 选择tmr3_pwm_o 
#define GPIO_FOUT_TMR2_PWMOUT           (0xF)        // 选择tmr2_pwm_o 
#define GPIO_FOUT_TMR1_PWMOUT           (0x10)       // 选择tmr1_pwm_o (注意配置 FOUT_SEL[1]=0)
#define GPIO_FOUT_LED_SEG9              (0x10)       // 选择led_seg9   (注意配置 FOUT_SEL[1]=1)
#define GPIO_FOUT_TMR0_PWMOUT           (0x11)       // 选择tmr0_pwm_o (注意配置 FOUT_SEL[0]=0)
#define GPIO_FOUT_LED_SEG8              (0x11)       // 选择led_seg8   (注意配置 FOUT_SEL[0]=1)
#define GPIO_FOUT_LED_SEG0              (0x12)       // 选择led_seg0 
#define GPIO_FOUT_LED_SEG1              (0x13)       // 选择led_seg1 
#define GPIO_FOUT_LED_SEG2              (0x14)       // 选择led_seg2 
#define GPIO_FOUT_LED_SEG3              (0x15)       // 选择led_seg3 
#define GPIO_FOUT_LED_SEG4              (0x16)       // 选择led_seg4 
#define GPIO_FOUT_LED_SEG5              (0x17)       // 选择led_seg5 
#define GPIO_FOUT_LED_SEG6              (0x18)       // 选择led_seg6 
#define GPIO_FOUT_LED_SEG7              (0x19)       // 选择led_seg7 
#define GPIO_FOUT_LED_COM0              (0x1A)       // 选择led_com0 
#define GPIO_FOUT_LED_COM1              (0x1B)       // 选择led_com1 
#define GPIO_FOUT_LED_COM2              (0x1C)       // 选择led_com2 
#define GPIO_FOUT_LED_COM3              (0x1D)       // 选择led_com3 
#define GPIO_FOUT_LED_COM4              (0x1E)       // 选择led_com4 
#define GPIO_FOUT_LED_COM5              (0x1F)       // 选择led_com5 

/*****************************************************************************************
|----------------------------------------------------------------------------------------|
|         | Bit |                    Description                                         |
|         |------------------------------------------------------------------------------|
|         | 7~6 |                                                                        |
|         |  5  | 功能输出io复用通道的选择位  0x0: 选择stmr2_pwmout  0x1: 选择led_com7   |
| FOUT_SEL|  4  | 功能输出io复用通道的选择位  0x0: 选择stmr3_pwmout  0x1: 选择led_seg6   |
|         |  3  | 功能输出io复用通道的选择位  0x0: 选择stmr4_pwmout  0x1: 选择led_com11  |
|         |  2  | 功能输出io复用通道的选择位  0x0: 选择stmr5_pwmout  0x1: 选择led_seg10  |
|         |  1  | 功能输出io复用通道的选择位  0x0: 选择tmr1_pwm_o    0x1: 选择led_seg9   |
|         |  0  | 功能输出io复用通道的选择位  0x0: 选择tmr0_pwm_o    0x1: 选择led_seg8   |
|----------------------------------------------------------------------------------------|
*****************************************************************************************/
// FOUT_SEL
#define _FOUT_SEL
#define GPIO_FOUT5_SEL(n)               ((n) << 5)   // 功能输出io复用通道的选择位  0x0: 选择stmr2_pwmout  0x1: 选择led_com7 
#define GPIO_FOUT4_SEL(n)               ((n) << 4)   // 功能输出io复用通道的选择位  0x0: 选择stmr3_pwmout  0x1: 选择led_seg6 
#define GPIO_FOUT3_SEL(n)               ((n) << 3)   // 功能输出io复用通道的选择位  0x0: 选择stmr4_pwmout  0x1: 选择led_com11
#define GPIO_FOUT2_SEL(n)               ((n) << 2)   // 功能输出io复用通道的选择位  0x0: 选择stmr5_pwmout  0x1: 选择led_seg10
#define GPIO_FOUT1_SEL(n)               ((n) << 1)   // 功能输出io复用通道的选择位  0x0: 选择tmr1_pwm_o    0x1: 选择led_seg9 
#define GPIO_FOUT0_SEL(n)               ((n) << 0)   // 功能输出io复用通道的选择位  0x0: 选择tmr0_pwm_o    0x1: 选择led_seg8 

/**************************************************************************************************************************
|-------------------------------------------------------------------------------------------------------------------------|
|         | Bit |                    Description                                                                          |
|         |---------------------------------------------------------------------------------------------------------------|
|         | 7:5 |                                                                                                         |
|---------|---------------------------------------------------------------------------------------------------------------|
| FIN_S0  |     | tmr0_cap_pin 输入功能pin脚选择.                                                                         |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S1  |     | tmr1_cap_pin 输入功能pin脚选择.                                                                         |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S2  |     | tmr2_cap_pin 输入功能pin脚选择.                                                                         |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S3  |     | tmr3_cap_pin 输入功能pin脚选择.                                                                         |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S4  |     | tmr4_cap0_pin 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S5  |     | tmr4_cap1_pin 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S6  |     | tmr4_cap2_pin 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S7  |     | uart0_rx 输入功能pin脚选择.                                                                             |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S8  |     | uart1_rx 输入功能pin脚选择.                                                                             |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S9  |     | wut_cap_pin 输入功能pin脚选择.                                                                          |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S10 |     | port_wkup_in0 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S11 |     | port_wkup_in1 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S12 |     | port_wkup_in2 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S13 |     | port_wkup_in3 输入功能pin脚选择.                                                                        |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S14 |     | fb_in 输入功能pin脚选择.                                                                                |
|---------|     |---------------------------------------------------------------------------------------------------------|
| FIN_S15 |     | adc_etr 输入功能pin脚选择.                                                                              |
|---------|     |---------------------------------------------------------------------------------------------------------|
|         |     | 0x0:选择固定输入低电平                                                                                  |
|         |     | 0x1:选择P00  0x2:选择P01  0x3:选择P02  0x4:选择P03  0x5:选择P04  0x6:选择P05  0x7:选择P06  0x8:选择P07  |
|         | 4:0 | 0x9:选择P10  0xA:选择P11  0xB:选择P12  0xC:选择P13  0xD:选择P14  0xE:选择P15  0xF:选择P16 0x10:选择P17  |
|         |     | 0x11:选择P20 0x12:选择P21 0x13:选择P22 0x14:选择P23 0x15:选择P24 0x16:选择P25 0x17:选择P26 0x18:选择P27 |
|         |     | 0x19:选择P30 0x1A:选择P31                                                                               |
|-------------------------------------------------------------------------------------------------------------------------|
**************************************************************************************************************************/
// FIN_S0~FIN_S15
#define _FIN_S0                                      // tmr0_cap_pin 输入功能pin脚选择
#define _FIN_S1                                      // tmr1_cap_pin 输入功能pin脚选择
#define _FIN_S2                                      // tmr2_cap_pin 输入功能pin脚选择
#define _FIN_S3                                      // tmr3_cap_pin 输入功能pin脚选择
#define _FIN_S4                                      // tmr4_cap0_pin 输入功能pin脚选择
#define _FIN_S5                                      // tmr4_cap1_pin 输入功能pin脚选择
#define _FIN_S6                                      // tmr4_cap2_pin 输入功能pin脚选择
#define _FIN_S7                                      // uart0_rx 输入功能pin脚选择
#define _FIN_S8                                      // uart1_rx 输入功能pin脚选择
#define _FIN_S9                                      // wut_cap_pin 输入功能pin脚选择
#define _FIN_S10                                     // port_wkup_in0 输入功能pin脚选择
#define _FIN_S11                                     // port_wkup_in1 输入功能pin脚选择
#define _FIN_S12                                     // port_wkup_in2 输入功能pin脚选择
#define _FIN_S13                                     // port_wkup_in3 输入功能pin脚选择
#define _FIN_S14                                     // fb_in 输入功能pin脚选择
#define _FIN_S15                                     // adc_etr 输入功能pin脚选择

#define GPIO_FIN_SEL_GND                (0x0)        // 选择固定输入低电平
#define GPIO_FIN_SEL_P00                (0x1)        // 选择P00 
#define GPIO_FIN_SEL_P01                (0x2)        // 选择P01 
#define GPIO_FIN_SEL_P02                (0x3)        // 选择P02
#define GPIO_FIN_SEL_P03                (0x4)        // 选择P03 
#define GPIO_FIN_SEL_P04                (0x5)        // 选择P04
#define GPIO_FIN_SEL_P05                (0x6)        // 选择P05
#define GPIO_FIN_SEL_P06                (0x7)        // 选择P06 
#define GPIO_FIN_SEL_P07                (0x8)        // 选择P07  
#define GPIO_FIN_SEL_P10                (0x9)        // 选择P10 
#define GPIO_FIN_SEL_P11                (0xA)        // 选择P11 
#define GPIO_FIN_SEL_P12                (0xB)        // 选择P12 
#define GPIO_FIN_SEL_P13                (0xC)        // 选择P13 
#define GPIO_FIN_SEL_P14                (0xD)        // 选择P14 
#define GPIO_FIN_SEL_P15                (0xE)        // 选择P15 
#define GPIO_FIN_SEL_P16                (0xF)        // 选择P16 
#define GPIO_FIN_SEL_P17                (0x10)       // 选择P17
#define GPIO_FIN_SEL_P20                (0x11)       // 选择P20 
#define GPIO_FIN_SEL_P21                (0x12)       // 选择P21 
#define GPIO_FIN_SEL_P22                (0x13)       // 选择P22 
#define GPIO_FIN_SEL_P23                (0x14)       // 选择P23 
#define GPIO_FIN_SEL_P24                (0x15)       // 选择P24 
#define GPIO_FIN_SEL_P25                (0x16)       // 选择P25 
#define GPIO_FIN_SEL_P26                (0x17)       // 选择P26 
#define GPIO_FIN_SEL_P27                (0x18)       // 选择P27 
#define GPIO_FIN_SEL_P30                (0x19)       // 选择P30 
#define GPIO_FIN_SEL_P31                (0x1A)       // 选择P31

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/


#ifdef __cplusplus
}
#endif

#endif // __GPIO_H__

/**
  * @}
  */

/**
  * @}
  */

/*************************** (C) COPYRIGHT 2021 HUGE-IC ***** END OF FILE *****/
