/**
  ******************************************************************************
  * @file    amp.h
  * @author  HUGE-IC Application Team
  * @version V1.0.0
  * @date    01-05-2021
  * @brief   This file contains all the SYSTEM LL firmware functions.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2021 HUGE-IC</center></h2>
  *
  *
  */ 
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AMP_H__
#define __AMP_H__

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/


/***************************************************************************************************
|--------------------------------------------------------------------------------------------------|
|                                            AMP                                                   |
|--------------------------------------------------------------------------------------------------|
***************************************************************************************************/

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            |  7  |                                                                      |
|            |  6  | 运放比较器中断触发边沿选择      0x0:上升沿触发  0x1:下降沿触发       |
|            |  5  | 运放PGA2的比较器触发中断使能位  0x0:不使能      0x1:使能中断         |
|  AMP_CON0  |  4  | 运放PGA1的比较器触发中断使能位  0x0:不使能      0x1:使能中断         |
|            |  3  | 运放PGA0的比较器触发中断使能位  0x0:不使能      0x1:使能中断         |
|            |  2  | 运放PGA1的比较器输出值                                               |
|            |  1  | 运放PGA1的比较器输出值                                               |
|            |  0  | 运放PGA0的比较器输出值                                               |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON0
#define _AMP_CON0
#define AMP_TRIG_SEL(n)            ((n) << 6)  // 运放比较器中断触发边沿选择      0x0:上升沿触发  0x1:下降沿触发
#define AMP_CMP2_IRQ_EN(n)         ((n) << 5)  // 运放PGA2的比较器触发中断使能位  0x0:不使能      0x1:使能中断
#define AMP_CMP1_IRQ_EN(n)         ((n) << 4)  // 运放PGA1的比较器触发中断使能位  0x0:不使能      0x1:使能中断
#define AMP_CMP0_IRQ_EN(n)         ((n) << 3)  // 运放PGA0的比较器触发中断使能位  0x0:不使能      0x1:使能中断
#define AMP_CMP2_OUT(n)            ((n) << 2)  // 运放PGA1的比较器输出值
#define AMP_CMP1_OUT(n)            ((n) << 1)  // 运放PGA1的比较器输出值
#define AMP_CMP0_OUT(n)            ((n) << 0)  // 运放PGA0的比较器输出值

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:5 | PGA0内置负向输入电阻选择  0x0:160KΩ  0x1:80KΩ  0x2:40KΩ   0x3:20KΩ   |
|            |     |                           0x4:10KΩ   0x5:5KΩ   0x6:2.5KΩ  0x7:1.25KΩ |
|  AMP_CON1  |     | Note:和RFB配合起来在负向输入PGA模式获得0dB增益,                      |
|            |     |      在正向输入PGA模式获得6dB增益!                                   |
|            | 4:3 | PGA0内置反馈电阻选择  0x0:80KΩ  0x1:160KΩ  0x2:320KΩ  0x3:640KΩ      |
|            | 2:0 | PGA0的偏置电流选择                                                   |
|            |     | BIT0为运放总电流选择,BIT1为输出级电流选择,BIT2为OFFSET电流选择;      |
|            |     | 对应BIT置1为大电流,0为小电流;default=1,即只有运放总电流选择大电流;   |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON1
#define _AMP_CON1
#define AMP_PGA0_RIN(n)            ((n) << 5)  // PGA0内置负向输入电阻选择  0x0:160KΩ  0x1:80KΩ  0x2:40KΩ   0x3:20KΩ
                                               //                           0x4:10KΩ   0x5:5KΩ   0x6:2.5KΩ  0x7:1.25KΩ
                                               // Note:和RFB配合起来在负向输入PGA模式获得0dB增益,在正向输入PGA模式获得6dB增益!
#define AMP_PGA0_RFB(n)            ((n) << 3)  // PGA0内置反馈电阻选择  0x0:80KΩ  0x1:160KΩ  0x2:320KΩ  0x3:640KΩ
#define AMP_PGA0_IB(n)             ((n) << 0)  // PGA0的偏置电流选择
                                               // BIT0为运放总电流选择,BIT1为输出级电流选择,BIT2为OFFSET电流选择;
                                               // 对应BIT置1为大电流,0为小电流;default=1,即只有运放总电流选择大电流;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:0 | PGA0的offset trim选项                                                |
|            |     | 其中BIT7为符号位,BIT6:0为选择位。在trim模式,                         |
|  AMP_CON2  |     | 如果CMPOUT_VDD=0,对应的BIT7置0,BIT6:0逐渐增大直至CMPOUT_VDD=1;       |
|            |     | 如果CMPOUT_VDD=1,对应的BIT7置1,BIT6:0逐渐增大直至CMPOUT_VDD=0;       |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON2
#define _AMP_CON2
#define AMP_PGA0_TRIM(n)            ((n) << 0)  // PGA0的offset trim选项
                                                // 其中BIT7为符号位,BIT6:0为选择位。在trim模式,
                                                // 如果CMPOUT_VDD=0,对应的BIT7置0,BIT6:0逐渐增大直至CMPOUT_VDD=1;
                                                // 如果CMPOUT_VDD=1,对应的BIT7置1,BIT6:0逐渐增大直至CMPOUT_VDD=0;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:5 | PGA1内置负向输入电阻选择  0x0:160KΩ  0x1:80KΩ  0x2:40KΩ   0x3:20KΩ   |
|            |     |                           0x4:10KΩ   0x5:5KΩ   0x6:2.5KΩ  0x7:1.25KΩ |
|  AMP_CON3  |     | Note:和RFB配合起来在负向输入PGA模式获得0dB增益,                      |
|            |     |      在正向输入PGA模式获得6dB增益!                                   |
|            | 4:3 | PGA1内置反馈电阻选择  0x0:80KΩ  0x1:160KΩ  0x2:320KΩ  0x3:640KΩ      |
|            | 2:0 | PGA1的偏置电流选择                                                   |
|            |     | BIT0为运放总电流选择,BIT1为输出级电流选择,BIT2为OFFSET电流选择;      |
|            |     | 对应BIT置1为大电流,0为小电流;default=1,即只有运放总电流选择大电流;   |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON3
#define _AMP_CON3
#define AMP_PGA1_RIN(n)            ((n) << 5)  // PGA1内置负向输入电阻选择  0x0:160KΩ  0x1:80KΩ  0x2:40KΩ   0x3:20KΩ
                                               //                           0x4:10KΩ   0x5:5KΩ   0x6:2.5KΩ  0x7:1.25KΩ
                                               // Note:和RFB配合起来在负向输入PGA模式获得0dB增益,在正向输入PGA模式获得6dB增益!
#define AMP_PGA1_RFB(n)            ((n) << 3)  // PGA1内置反馈电阻选择  0x0:80KΩ  0x1:160KΩ  0x2:320KΩ  0x3:640KΩ
#define AMP_PGA1_IB(n)             ((n) << 0)  // PGA1的偏置电流选择
                                               // BIT0为运放总电流选择,BIT1为输出级电流选择,BIT2为OFFSET电流选择;
                                               // 对应BIT置1为大电流,0为小电流;default=1,即只有运放总电流选择大电流;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:0 | PGA1的offset trim选项                                                |
|            |     | 其中BIT7为符号位,BIT6:0为选择位。在trim模式,                         |
|  AMP_CON4  |     | 如果CMPOUT_VDD=0,对应的BIT7置0,BIT6:0逐渐增大直至CMPOUT_VDD=1;       |
|            |     | 如果CMPOUT_VDD=1,对应的BIT7置1,BIT6:0逐渐增大直至CMPOUT_VDD=0;       |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON4
#define _AMP_CON4
#define AMP_PGA1_TRIM(n)            ((n) << 0)  // PGA1的offset trim选项
                                                // 其中BIT7为符号位,BIT6:0为选择位。在trim模式,
                                                // 如果CMPOUT_VDD=0,对应的BIT7置0,BIT6:0逐渐增大直至CMPOUT_VDD=1;
                                                // 如果CMPOUT_VDD=1,对应的BIT7置1,BIT6:0逐渐增大直至CMPOUT_VDD=0;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:5 | PGA2内置负向输入电阻选择  0x0:160KΩ  0x1:80KΩ  0x2:40KΩ   0x3:20KΩ   |
|            |     |                           0x4:10KΩ   0x5:5KΩ   0x6:2.5KΩ  0x7:1.25KΩ |
|  AMP_CON5  |     | Note:和RFB配合起来在负向输入PGA模式获得0dB增益,                      |
|            |     |      在正向输入PGA模式获得6dB增益!                                   |
|            | 4:3 | PGA2内置反馈电阻选择  0x0:80KΩ  0x1:160KΩ  0x2:320KΩ  0x3:640KΩ      |
|            | 2:0 | PGA2的偏置电流选择                                                   |
|            |     | BIT0为运放总电流选择,BIT1为输出级电流选择,BIT2为OFFSET电流选择;      |
|            |     | 对应BIT置1为大电流,0为小电流;default=1,即只有运放总电流选择大电流;   |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON5
#define _AMP_CON5
#define AMP_PGA2_RIN(n)            ((n) << 5)  // PGA2内置负向输入电阻选择  0x0:160KΩ  0x1:80KΩ  0x2:40KΩ   0x3:20KΩ
                                               //                           0x4:10KΩ   0x5:5KΩ   0x6:2.5KΩ  0x7:1.25KΩ
                                               // Note:和RFB配合起来在负向输入PGA模式获得0dB增益,在正向输入PGA模式获得6dB增益!
#define AMP_PGA2_RFB(n)            ((n) << 3)  // PGA2内置反馈电阻选择  0x0:80KΩ  0x1:160KΩ  0x2:320KΩ  0x3:640KΩ
#define AMP_PGA2_IB(n)             ((n) << 0)  // PGA2的偏置电流选择
                                               // BIT0为运放总电流选择,BIT1为输出级电流选择,BIT2为OFFSET电流选择;
                                               // 对应BIT置1为大电流,0为小电流;default=1,即只有运放总电流选择大电流;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:0 | PGA2的offset trim选项                                                |
|            |     | 其中BIT7为符号位,BIT6:0为选择位。在trim模式,                         |
|  AMP_CON6  |     | 如果CMPOUT_VDD=0,对应的BIT7置0,BIT6:0逐渐增大直至CMPOUT_VDD=1;       |
|            |     | 如果CMPOUT_VDD=1,对应的BIT7置1,BIT6:0逐渐增大直至CMPOUT_VDD=0;       |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON6
#define _AMP_CON6
#define AMP_PGA2_TRIM(n)            ((n) << 0)  // PGA2的offset trim选项
                                                // 其中BIT7为符号位,BIT6:0为选择位。在trim模式,
                                                // 如果CMPOUT_VDD=0,对应的BIT7置0,BIT6:0逐渐增大直至CMPOUT_VDD=1;
                                                // 如果CMPOUT_VDD=1,对应的BIT7置1,BIT6:0逐渐增大直至CMPOUT_VDD=0;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:5 | AMP内部反馈通路选择                                                  |
|            |     | 0=使用外部输入电阻和反馈电阻,即运放模式;                             |
|            |     | 1=使用内部输入电阻和反馈电阻,即PGA模式;                              |
|  AMP_CON7  |     | 默认Channel 2为PGA模式,Channel 0/1为AMP模式;                         |
|            | 4:3 | AMP内置比较器模式使能                                                |
|            |     | 比较器的输入为PGA的输出,参考比较电压为0.5*VCCA;1为>0.5VCCA           |
|            |     | 0为<0.5VCCA。如果使用AMP模式且不加外部的输入电阻和反馈电阻,          |
|            |     | 则为普通比较器模式,即IP>IN=1,IP<IN=0;                                |
|            | 2:0 | PGA输出到下一级PGA模式输入的使能CH_SEL_VDD<0>选通PGA0输出到PGA1的    |
|            |     | 输入,CH_SEL_VDD<1>选通PGA1输出到PGA2的输入;                          |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON7
#define _AMP_CON7
#define AMP_ADC_FB_SEL(n)          ((n) << 5)  // AMP内部反馈通路选择
                                               // 0=使用外部输入电阻和反馈电阻,即运放模式;
                                               // 1=使用内部输入电阻和反馈电阻,即PGA模式;
                                               // 默认Channel 2为PGA模式,Channel 0/1为AMP模式;
#define AMP_AMP_CMP_MODE(n)        ((n) << 3)  // AMP内置比较器模式使能
                                               // 比较器的输入为PGA的输出,参考比较电压为0.5*VCCA;1为>0.5VCCA 
                                               // 0为<0.5VCCA。如果使用AMP模式且不加外部的输入电阻和反馈电阻,
                                               // 则为普通比较器模式,即IP>IN=1,IP<IN=0;
#define AMP_AMP_CH_SEL(n)          ((n) << 0)  // PGA输出到下一级PGA模式输入的使能CH_SEL_VDD<0>选通PGA0输出到PGA1的
                                               // 输入,CH_SEL_VDD<1>选通PGA1输出到PGA2的输入;

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:5 | AMP负向输入端到IO的通路选择使能                                      |
|            |     | 0x0: 3个AMP都不使能  0x1: AMP0 使能  0x2: AMP1 使能  0x4: AMP2 使能  |
|            |     | 每1bit对应1个AMP,BIT0对应 AMP0,BIT1对应AMP1,BIT2对应AMP2其他选项应该 |
|            |     | 在实际使用中避免配置,减少相互串扰                                    |
|            | 4:0 | BIT0:PGA2的IP选通到PGA0的IN使能                                      |
|  AMP_CON8  |     | BIT1:PGA2的IN选通到PGA0的IP使能                                      |
|            |     | BIT2:PGA2的IN选通到AVSS(VSSPGA)使能                                  |
|            |     | BIT3:PGA2的OUT输出通过10K电阻到PGAOUTF使能                           |
|            |     | BIT4:PGA2的OUTI选通到PGA2的VINI使能                                  |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON8
#define _AMP_CON8
#define AMP_AMP_IN2_IO(n)          ((n) << 5)  // AMP负向输入端到IO的通路选择使能
                                               // 0x0: 3个AMP都不使能  0x1: AMP0 使能  0x2: AMP1 使能  0x4: AMP2 使能
                                               // 每1bit对应1个AMP,BIT0对应 AMP0,BIT1对应AMP1,BIT2对应AMP2其他选项应该
                                               // 在实际使用中避免配置,减少相互串扰
#define AMP_AMP_PGA2_IO(n)         ((n) << 0)  // BIT0:PGA2的IP选通到PGA0的IN使能
                                               // BIT1:PGA2的IN选通到PGA0的IP使能
                                               // BIT2:PGA2的IN选通到AVSS(VSSPGA)使能
                                               // BIT3:PGA2的OUT输出通过10K电阻到PGAOUTF使能
                                               // BIT4:PGA2的OUTI选通到PGA2的VINI使能

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:5 | AMP 正向输入端到 IO 的通路选择使能                                   |
|            |     | 0x0:3个AMP都不使能  0x1:AMP0使能  0x2:AMP1使能  0x4:AMP2使能         |
|            |     | 每1bit对应1个AMP,BIT0对应AMP0,BIT1对应AMP1,BIT2对应AMP2其他选项应该在|
|            |     | 实际使用中避免配置,减少相互串扰                                      |
|  AMP_CON9  | 4:2 | AMP内部正负输入端短接功能，用于offset校正  0x0:不短接  0x1:短接      |
|            |  1  | AMP模块低功耗模式使能(功耗<1uA)  0x0:正常模式  0x1:低功耗模式        |
|            |  0  | PGA总偏置电流选择  0x0:1X  0x1:2X                                    |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON9
#define _AMP_CON9
#define AMP_AMP_IP2_IO(n)          ((n) << 5)  // AMP 正向输入端到 IO 的通路选择使能
                                               // 0x0:3个AMP都不使能  0x1:AMP0使能  0x2:AMP1使能  0x4:AMP2使能
                                               // 每1bit对应1个AMP,BIT0对应AMP0,BIT1对应AMP1,BIT2对应AMP2其他选项应该在
                                               // 实际使用中避免配置,减少相互串扰
#define AMP_AMP_IP2_IN(n)          ((n) << 2)  // AMP内部正负输入端短接功能，用于offset校正  0x0:不短接  0x1:短接
#define AMP_AMP_LP_EN(n)           ((n) << 1)  // AMP模块低功耗模式使能(功耗<1uA)  0x0:正常模式  0x1:低功耗模式
#define AMP_AMP_PGA_IB(n)          ((n) << 0)  // PGA总偏置电流选择  0x0:1X  0x1:2X

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:6 |                                                                      |
|            | 5:3 | AMP 输出端到 IO 的通路选择使能                                       |
|            |     | 0x0:3个AMP都不使能  0x1:AMP0使能  0x2:AMP1使能  0x4:AMP2使能         |
|            |     | 每1bit对应1个AMP,BIT0对应AMP0,BIT1对应AMP1,BIT2对应AMP2其他选项应该在|
|            |     | 实际使用中避免配置,减少相互串扰                                      |
|  AMP_CON10 | 2:0 | AMP正向输入端口选择                                                  |
|            |     | 0x0:外部IO输入(注意对应的IP2IO要使能)  0x1:内部1.2V参考电压          |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON10
#define _AMP_CON10
#define AMP_AMP_OUT2_IO(n)         ((n) << 3)  // AMP 输出端到 IO 的通路选择使能
                                               // 0x0:3个AMP都不使能  0x1:AMP0使能  0x2:AMP1使能  0x4:AMP2使能
                                               // 每1bit对应1个AMP,BIT0对应AMP0,BIT1对应AMP1,BIT2对应AMP2其他选项应该在
                                               // 实际使用中避免配置,减少相互串扰
#define AMP_AMP_IP_SEL(n)          ((n) << 0)  // AMP正向输入端口选择
                                               // 0x0:外部IO输入(注意对应的IP2IO要使能)  0x1:内部1.2V参考电压

/******************************************************************************************
|-----------------------------------------------------------------------------------------|
|            | Bit |                    Description                                       |
|            |----------------------------------------------------------------------------|
|            | 7:3 |                                                                      |
|            |  2  | PGA2使能  0x0:不使能  0x1:使能                                       |
|  AMP_CON11 |  1  | PGA1使能  0x0:不使能  0x1:使能                                       |
|            |  0  | PGA0使能  0x0:不使能  0x1:使能                                       |
|-----------------------------------------------------------------------------------------|
******************************************************************************************/
// AMP_CON11
#define _AMP_CON11
#define AMP_PGA2_EN(n)             ((n) << 2)  // PGA2使能  0x0:不使能  0x1:使能
#define AMP_PGA1_EN(n)             ((n) << 1)  // PGA1使能  0x0:不使能  0x1:使能
#define AMP_PGA0_EN(n)             ((n) << 0)  // PGA0使能  0x0:不使能  0x1:使能



/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

#ifdef __cplusplus
}
#endif

#endif // __AMP_H__

/**
  * @}
  */

/**
  * @}
  */

/*************************** (C) COPYRIGHT 2021 HUGE-IC ***** END OF FILE *****/
